Revit 2024 API
Connector.Demand Property
The demand of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Demand { get; }
Visual Basic
Public ReadOnly Property Demand As Double
	Get
Visual C++
public:
property double Demand {
	double get ();
}
Remarks
Instantaneous demand at this connector, calculated according to system.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the connector's domain is not DomainPiping.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown on failure to get demand.
See Also
Connector Class
Autodesk.Revit.DB Namespace